u-blox/cellular/port/platform/nordic/nrf52840/src/cellular_port_uart.c
/*
 * Copyright 2020 u-blox Cambourne Ltd
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 * 
    http://www.apache.org/licenses/LICENSE-2.0
 * 
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 */

#ifdef CELLULAR_CFG_OVERRIDE
# include "cellular_cfg_override.h" // For a customer's configuration override
#endif
#include "cellular_cfg_sw.h"
#include "cellular_port_debug.h"
#include "cellular_port_clib.h"
#include "cellular_port.h"
#include "cellular_port_os.h"
#include "cellular_port_uart.h"
#include "cellular_port_private.h"

#include "FreeRTOS.h"
#include "queue.h"
#include "task.h"

#include "nrf.h"
#include "nrf_uarte.h"
#include "nrf_gpio.h"

/* Note: in order to implement the API we require, where receipt
 * of data is signalled by an event queue and other things can 
 * send to that same event queue, this code is implemented on top of
 * the nrf_uarte.h HAL and replaces the nrfx_uarte.h default driver
 * from Nordic.  It steals from the code in nrfx_uarte.c, Nordic's
 * implementation.
 *
 * So that users can continue to use the Nordic UARTE driver this
 * code uses only the UART port that the Nordic UARTE driver is NOT
 * using: for instance, to use UARTE1 in this driver then
 * NRFX_UARTE1_ENABLED should be set to 0 in sdk_config to free it
 * up.
 *
 * Design note: at first this code used DMA plus a per-character
 * interrupt to count the characters and send an event when the
 * number unread transitioned from 0 to 1 but the load of sending the
 * event was too high and interrupts were missed, leading to losing
 * count. So the timer already in use for cellularPortGetTickTimeMs()
 * was modified to generate interrupts more quickly (130 ms interval)
 * when the UART is operating and take a callback which could be
 * used to stop the free-running DMA and query it for the number
 * of characters received.  This worked well except that it was
 * still pouring characters directly into the destination buffer
 * and this caused a problem towards the end of the buffer where
 * the space for DMA would be getting close to zero and the load of
 * setup etc. for the next DMA became too much.  So instead the
 * buffer space was split into separately managed sub-buffers, at
 * least two in number, and then advantage could be taken of the
 * hardware's ability to set up a second buffer in advance
 * of the first completing ('cos the buffer pointer register is
 * itself buffered).  Finally, no character loss, though some buffer
 * management is required at setup and when reading the data out again.
 */

/* ----------------------------------------------------------------
 * COMPILE-TIME MACROS
 * -------------------------------------------------------------- */

// The maximum number of UARTs supported, which is the range of the
// "uart" parameter on this platform
#ifndef NRFX_UARTE_ENABLED
// NRFX_UARTE is not enabled, we can have both
# define CELLULAR_PORT_UART_MAX_NUM 2
#else 
# if !NRFX_UARTE0_ENABLED && !NRFX_UARTE1_ENABLED
// NRFX_UARTE is enabled but neither UARTEx is enabled so we can
// have both
#  define CELLULAR_PORT_UART_MAX_NUM 2
# else
#  if !NRFX_UARTE0_ENABLED || !NRFX_UARTE1_ENABLED
#    define CELLULAR_PORT_UART_MAX_NUM 1
#  else
#    error No UARTs available, both are being used by the Nordic NRFX_UARTE driver; to use this code at least one of NRFX_UARTE0_ENABLED or NRFX_UARTE1_ENABLED must be set to 0.
#  endif
# endif
#endif

// Maximum length of DMA on NRF52840 HW.
#ifndef CELLULAR_PORT_UART_SUB_BUFFER_SIZE
# define CELLULAR_PORT_UART_SUB_BUFFER_SIZE 256
#endif

// The number of sub-buffers.
// We want at least two buffers and beyond that a number of buffers
// that brings the size of each under the maximum DMA length.
// IMPORTANT: this means that for this platform it is best if
// CELLULAR_PORT_UART_RX_BUFFER_SIZE is a multiple of 256,
// which it is with the default of 1024.
#define CELLULAR_PORT_UART_NUM_SUB_BUFFERS ((CELLULAR_PORT_UART_RX_BUFFER_SIZE / 2) / CELLULAR_PORT_UART_SUB_BUFFER_SIZE)

#if CELLULAR_PORT_UART_NUM_SUB_BUFFERS < 2
# error Cannot accommodate even two sub-buffers, either increase CELLULAR_PORT_UART_RX_BUFFER_SIZE to a larger multiple of CELLULAR_PORT_UART_SUB_BUFFER_SIZE or reduce CELLULAR_PORT_UART_SUB_BUFFER_SIZE.
#endif

/* ----------------------------------------------------------------
 * TYPES
 * -------------------------------------------------------------- */

/** Structure to hold a UART event.
 */
typedef struct {
    int32_t type;
    size_t size;
} CellularPortUartEventData_t;

/** UART buffer structure, which can be used as a list.
 */
typedef struct CellularPortUartBuffer_t {
    char *pStart;
    volatile size_t toRead;
    struct CellularPortUartBuffer_t *pNext;
} CellularPortUartBuffer_t;

/** Structure of the things we need to keep track of per UART.
 */
typedef struct {
    NRF_UARTE_Type *pReg;
    CellularPortMutexHandle_t mutex;
    CellularPortQueueHandle_t queue;
    volatile size_t toRead;
    CellularPortUartBuffer_t *pReadBuffer;
    volatile CellularPortUartBuffer_t *pWriteBuffer;
    bool userNeedsNotify; //!< set this if toRead has hit zero and
                          // hence the user would like a notification
                          // when new data arrives.
    CellularPortUartBuffer_t rxBufferList[CELLULAR_PORT_UART_NUM_SUB_BUFFERS];
} CellularPortUartData_t;

/* ----------------------------------------------------------------
 * VARIABLES
 * -------------------------------------------------------------- */

// UART data, where the UARTE register is the only one initialised here.
#if !NRFX_UARTE0_ENABLED && !NRFX_UARTE1_ENABLED
static CellularPortUartData_t gUartData[] = {{NRF_UARTE0, },
                                             {NRF_UARTE1, }};
# else
#  if !NRFX_UARTE0_ENABLED 
static CellularPortUartData_t gUartData[] = {NRF_UARTE0, };
#  else
static CellularPortUartData_t gUartData[] = {NRF_UARTE1, };
#  endif
#endif

/* ----------------------------------------------------------------
 * STATIC FUNCTIONS
 * -------------------------------------------------------------- */

// Callback to be called when the receive check timer has expired.
// pParameter must be a pointer to CellularPortUartData_t.
static void rxCb(void *pParameter)
{
    CellularPortUartData_t *pUartData = (CellularPortUartData_t *) pParameter;

    nrf_uarte_task_trigger(pUartData->pReg,
                           NRF_UARTE_TASK_STOPRX);
}

// The interrupt handler: only handles Rx events as Tx is blocking.
static void rxIrqHandler(CellularPortUartData_t *pUartData)
{
    NRF_UARTE_Type *pReg = pUartData->pReg;
    BaseType_t yield = false;

    if (nrf_uarte_event_check(pReg, NRF_UARTE_EVENT_ENDRX)) {
        volatile CellularPortUartBuffer_t *pRxBuffer = pUartData->pWriteBuffer;
        size_t x;
        // Clear the event
        nrf_uarte_event_clear(pReg, NRF_UARTE_EVENT_ENDRX);
        // Grab the count of the number of bytes DMAed
        x = nrf_uarte_rx_amount_get(pReg);
        // Update the write buffer pointer
        pUartData->pWriteBuffer = pUartData->pWriteBuffer->pNext;
        // The next receive was already set up when the
        // RXTSTARTED came through earlier, just need to trigger
        // it, so do that ASAP
        nrf_uarte_task_trigger(pReg, NRF_UARTE_TASK_STARTRX);
        // Now update the counts/pointers
        pRxBuffer->toRead += x;
        pUartData->toRead += x;
        // If there is data and the user needs to be notified
        // 'cos there was none before, let them know
        if ((pUartData->toRead > 0) && pUartData->userNeedsNotify) {
            CellularPortUartEventData_t uartEvent;
            uartEvent.type = 0;
            uartEvent.size = pUartData->toRead;
            xQueueSendFromISR((QueueHandle_t *) (pUartData->queue),
                              &uartEvent, &yield);
            pUartData->userNeedsNotify = false;
        }
    } else if (nrf_uarte_event_check(pReg, NRF_UARTE_EVENT_RXSTARTED)) {
        // An RX has started so it's OK to update the buffer
        // pointer for the following one
        nrf_uarte_event_clear(pReg, NRF_UARTE_EVENT_RXSTARTED);
        nrf_uarte_rx_buffer_set(pReg,
                                (uint8_t *) (pUartData->pWriteBuffer->pNext->pStart),
                                CELLULAR_PORT_UART_SUB_BUFFER_SIZE);
    } else if (nrf_uarte_event_check(pReg, NRF_UARTE_EVENT_RXTO)) {
        // We've been stopped, must have been a timeout.
        // No need to do anything here since ENDRX will
        // be signalled in any case
        nrf_uarte_event_clear(pReg, NRF_UARTE_EVENT_RXTO);
    } else if (nrf_uarte_event_check(pReg, NRF_UARTE_EVENT_ERROR)) {
        // Clear any errors: no need to do anything, they
        // have no effect upon reception
        nrf_uarte_event_clear(pReg, NRF_UARTE_EVENT_ERROR);
        nrf_uarte_errorsrc_get_and_clear(pReg);
    }

    // Required for FreeRTOS task scheduling to work
    if (yield) {
        taskYIELD();
    }
}

// Convert a baud rate into an NRF52840 baud rate.
static int32_t baudRateToNrfBaudRate(int32_t baudRate)
{
    int32_t baudRateNrf = -1;

    switch (baudRate) {
        case 1200:
            baudRateNrf = UARTE_BAUDRATE_BAUDRATE_Baud1200;
        break;
        case 2400:
            baudRateNrf = UARTE_BAUDRATE_BAUDRATE_Baud2400;
        break;
        case 9600:
            baudRateNrf = UARTE_BAUDRATE_BAUDRATE_Baud9600;
        break;
        case 14400:
            baudRateNrf = UARTE_BAUDRATE_BAUDRATE_Baud14400;
        break;
        case 19200:
            baudRateNrf = UARTE_BAUDRATE_BAUDRATE_Baud19200;
        break;
        case 28800:
            baudRateNrf = UARTE_BAUDRATE_BAUDRATE_Baud28800;
        break;
        case 31250:
            baudRateNrf = UARTE_BAUDRATE_BAUDRATE_Baud31250;
        break;
        case 38400:
            baudRateNrf = UARTE_BAUDRATE_BAUDRATE_Baud38400;
        break;
        case 56000:
            baudRateNrf = UARTE_BAUDRATE_BAUDRATE_Baud56000;
        break;
        case 57600:
            baudRateNrf = UARTE_BAUDRATE_BAUDRATE_Baud57600;
        break;
        case 76800:
            baudRateNrf = UARTE_BAUDRATE_BAUDRATE_Baud76800;
        break;
        case 115200:
            baudRateNrf = UARTE_BAUDRATE_BAUDRATE_Baud115200;
        break;
        case 230400:
            baudRateNrf = UARTE_BAUDRATE_BAUDRATE_Baud230400;
        break;
        case 250000:
            baudRateNrf = UARTE_BAUDRATE_BAUDRATE_Baud250000;
        break;
        case 460800:
            baudRateNrf = UARTE_BAUDRATE_BAUDRATE_Baud460800;
        break;
        case 921600:
            baudRateNrf = UARTE_BAUDRATE_BAUDRATE_Baud921600;
        break;
        case 1000000:
            baudRateNrf = UARTE_BAUDRATE_BAUDRATE_Baud1M;
        break;
        default:
        break;
    }

    return baudRateNrf;
}

// Derived from the NRFX functions nrfx_is_in_ram() and
// nrfx_is_word_aligned(), check if a buffer pointer is good
// for DMA
__STATIC_INLINE bool isGoodForDma(void const *pBuffer)
{
    return (((((uint32_t) pBuffer) & 0x3u) == 0u) && 
            ((((uint32_t) pBuffer) & 0xE0000000u) == 0x20000000u));
}

// Derived from the NRFX function nrfx_get_irq_number()
__STATIC_INLINE IRQn_Type getIrqNumber(void const *pReg)
{
    return (IRQn_Type) (uint8_t)((uint32_t)(pReg) >> 12);
}

/* ----------------------------------------------------------------
 * PUBLIC FUNCTIONS: INTERRUPT HANDLERS
 * -------------------------------------------------------------- */

#if !NRFX_UARTE0_ENABLED
void nrfx_uarte_0_irq_handler(void)
{
    rxIrqHandler(&(gUartData[0]));
}
#endif

